<h1 style="font-size: 2.5em;">Membuat Data Frame dari hasil seleksi Spreadsheet</h1>

<h1 style="font-size: 1.6em;">Import Modules</h1>

In [10]:
import pandas as pd

print(pd.__version__)

2.2.2

<h1 style="font-size: 1.6em;">Membuat Data Frame dari hasil seleksi Spreadsheet</h1>

In [12]:
df = pd.read_clipboard()
df

       NIM  Nama
0  7218123  Tejo
1  7218162  Bejo
2  7218462   Adi

In [16]:
df = pd.read_clipboard() # kolom pertama yang di copy akan selalu menjadi nama kolom
df

   7218162  Bejo
0  7218462   Adi
1  7218243  Wati